zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hvms64k.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CXPI0</name>
      <description>CXPI</description>
      <headerStructName>CXPI</headerStructName>
      <baseAddress>0x402E0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>65536</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ERROR_CTL</name>
          <description>Error control</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x821C001F</resetMask>
          <fields>
            <field>
              <name>CH_IDX</name>
              <description>Specifies the channel index of the channel to which HW  injected channel transmitter errors applies.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_CRC_ERROR</name>
              <description>The crc field is inverted.

At the receiver, this should result in INTR.RX_CRC_ERROR activation.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_PID_PARITY_ERROR</name>
              <description>In cxpi mode, the PID parity bit P[1] is inverted from !(ID[5] ^ ID[4] ^ ID[3] ^ ID[1]) to (ID[5] ^ ID[4] ^ ID[3] ^ ID[1]).

At the receiver, this should result in INTR.RX_HEADER_PARITY_ERROR activation.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DATA_LENGTH_ERROR</name>
              <description>The transmitter continues to send logical '0' (during IFS) after CRC field is transmitted.

At the receiver, this should result in INTR.RX_DATA_LENGTH_ERROR activation.
At the transmitter, this should result in INTR.TX_DATA_LENGTH_ERROR activation.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DATA_STOP_ERROR</name>
              <description>The data field STOP bits are inverted to '0'.

At the receiver, this should result in INTR.RX_FRAME_ERROR activation.
At the transmitter, this should result in INTR.TX_FRAME_ERROR activation.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>Error injection enable:
'0': Disabled.
'1': Enabled.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TEST_CTL</name>
          <description>Test control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x8001001F</resetMask>
          <fields>
            <field>
              <name>CH_IDX</name>
              <description>Specifies the channel index of the channel to which test applies. The channel IO signals of channel indices CH_IDX and CH_NR-1 are connected as specified by MODE. CH_IDX should be in the range [0, CH_NR-2], as channel index CH_NR-1 is always involved in test and cannot be connected to itself. The test mode allows BOTH of the two connected channels to be tested.

Note: this testing functionality simplifies SW development, but may also be used in the field to verify correct channel functionality.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>Test mode:
'0': Partial disconnect from IOSS. This mode's isolation allows for device test without relying on an external cxpi transceiver. The IOSS 'tx' IO cell can be used to observe messages outside of the device.
- tx_in[CH_IDX] = IOSS cxpi_tx_in[CH_IDX].
- tx_in[CH_NR-1] = IOSS cxpi_tx_in[CH_IDX].
- rx_in[CH_IDX] = IOSS cxpi_tx_in[CH_IDX].
- rx_in[CH_NR-1] = IOSS cxpi_tx_in[CH_IDX].
- cxpi_tx_out[CH_IDX] = tx_out[CH_IDX] &amp; tx_out[CH_NR-1].
- cxpi_tx_out[CH_NR-1] = tx_out[CH_IDX] &amp; tx_out[CH_NR-1].

'1': Full disconnect from IOSS (the IOSS/HSIOM should disconnect 'tx_out' from the 'tx' IO cell). This mode's isolation allows for device test without effecting an operational cxpi cluster.
- tx_in[CH_IDX] = cxpi_tx_out[CH_IDX].
- tx_in[CH_NR-1] = cxpi_tx_out[CH_IDX].
- rx_in[CH_IDX] = cxpi_tx_out[CH_IDX].
- rx_in[CH_NR-1] = cxpi_tx_out[CH_IDX].
- cxpi_tx_out[CH_IDX] = tx_out[CH_IDX] &amp; tx_out[CH_NR-1].
- cxpi_tx_out[CH_NR-1] = tx_out[CH_IDX] &amp; tx_out[CH_NR-1].</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PARTIAL_DISCONNECT</name>
                  <description>Partial disconnect</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_DISCONNECT</name>
                  <description>Full disconnect</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLED</name>
              <description>Test enable:
'0': Disabled. Functional mode.
- tx_in[CH_IDX] = IOSS cxpi_tx_in[CH_IDX].
- tx_in[CH_NR-1] = IOSS cxpi_tx_in[CH_NR-1].
- rx_in[CH_IDX] = IOSS cxpi_rx_in[CH_IDX].
- rx_in[CH_NR-1] = IOSS cxpi_rx_in[CH_NR-1].
- cxpi_tx_out[CH_IDX] = tx_out[CH_IDX].
- cxpi_tx_out[CH_NR-1] = tx_out[CH_NR-1].
'1': Enabled. Test mode, specific test mode is specified by MODE.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FUNCTIONAL_MODE</name>
                  <description>Functional mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEST_MODE</name>
                  <description>Test mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>256</dimIncrement>
          <name>CH[%s]</name>
          <description>CXPI channel structure</description>
          <addressOffset>0x00008000</addressOffset>
          <register>
            <name>CTL0</name>
            <description>Control 0</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x10</resetValue>
            <resetMask>0xC9FF0391</resetMask>
            <fields>
              <field>
                <name>MODE</name>
                <description>Mode of operation:
'0': NRZ mode.
'1': PWM mode.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NRZ</name>
                    <description>NRZ mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PWM</name>
                    <description>PWM mode</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>AUTO_EN</name>
                <description>CXPI transceiver auto enable:
'0': Disabled.
'1': Enabled. The TX_RX_STATUS.EN_OUT field is controlled by HW.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RXPIDZERO_CHECK_EN</name>
                <description>Receive PID Zero Check Enable.
0 - No action if received PID[6:0] = 0 and PID[7]=1'b1.
1 - If received PID[6:0] = 0 and PID[7]=1'b1, HW (slave) does not clear CMD.RX_HEADER and will anticipate receiving header again (CMD.TX_HEADER=0). If CMD.TX_HEADER=1 in the same scenario, then HW (slave) clears CMD.RX_HEADER upon receiving the header follow by transmit PID. This mode is useful for case where polling method is used and CXPI controller is configured as slave. This would reduce dependency on SW to react to the header received within IBS=1.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FILTER_EN</name>
                <description>RX filter enable (for 'cxpi_rx_in')
'0': No filter
'1': Median 3 (default value) operates on the last three 'cxpi_rx_in' values. The sequences '000', '001', '010', and '100' result in a filtered value '0'. The sequences '111', '110', '101', and '011' result in a filtered value '1'.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PRESAMPLE_EN</name>
                <description>Pre-sample enable for PWM mode.
'0': Disbaled.
'1': Enabled
When sampling counter's value is greater than CTL1.T_LOW1, pre-sample FF will be set to '1' as long as detecting any '1' on 'cxpi_rx_in' and be cleared to '0' after sampling moment. At the sampling moment, if pre-sample FF or 'cxpi_rx_in' is '1', sample value will be '1', otherwise '0'.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IFS</name>
                <description>Inter Frame Space in bit periods:
'0'' Invalid.
...
'10': 10 bit periods
...
'31': 31 bit periods
Values of &lt;10 are not allowed.
This field is used for transmission/reception for adding waiting inter frame space. 
Note that after a valid transaction (after CRC), HW waits for 10 bits as EOF. Hence, by setting CTL0.IFS=0xA means that HW will wait for 10bits before transmitting a new transaction (not including the EOF).
Note: 0 is not allowed when IFS_WAIT=1. SW needs to ensure it has program valid values before it can set IFS_WAIT=1.
If IFS_WAIT=1 after timeout occurs, the value of CTL0.IFS would need to consider the timeout count i.e. (IFS needed - CTL2.TIMEOUT_LENGTH-1) to get the total idle time. For example if TIMEOUT_LENGTH=9 and IFS needed is 20, then CTL0.IFS is set to 10.</description>
                <bitRange>[20:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IBS</name>
                <description>Inter Byte Space in bit periods:
'0' No offset.
'1' 1 IBS is inserted per every byte frame.
...
'9' 9 IBS are inserted per every byte frame.
Values &gt;9 are invalid per spec.
This field is used to control number of IBS after every byte frame when transmitting message frame. 
Note that this field is the minimum IBS inserted for every byte frame as the SW may require some time to prepare the response when it receives the PID. 
When receiving, this field is ignored with the exception of receiving header and transmitting response. For receiving header and transmitting response, SW can enable IBS insertion by setting TIMEOUT_SEL=1/2 prior to setting CMD.RX_HEADER=1 and CMD.RX_RESPONSE=1. If the received header corresponds to transmit response, SW clears CMD.RX_RESPONSE =0 and sets TX FIFO and CMD.TX_RESPONSE=1. HW waits for minimum IBS before transmit response (if timeout has not occurred yet). It is prohibit to program IBS&gt;TIMEOUT_LENGTH. 
This field should not be changed during inflight transaction including EOF.</description>
                <bitRange>[24:21]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BIT_ERROR_IGNORE</name>
                <description>Specifies behavior on a detected bit error during header or response transmission:
'0': Message transfer is aborted.
'1': Message transfer is NOT aborted.

Note: This field does NOT effect the reporting of the bit error through INTR/STATUS.TX_BIT_ERROR; i.e. bit errors are always reported.
Note: This field must not be set to '1' when it is NRZ mode. This is due to delay in transceiver will cause the transmitter behavior undefined when error occurs.</description>
                <bitRange>[27:27]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>ABORT_TX_MSG</name>
                    <description>Message transfer is aborted</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CONT_TX_MSG</name>
                    <description>Message transfer is NOT aborted</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MASTER</name>
                <description>CXPI master mode.
'0': Indicates CXPI as slave node.
'1': Indicates CXPI as master node.
This bit is only valid if ENABLED=1. SW needs to set only 1 node as master within the same CXPI cluster. SW needs to set this bit either at the same time as ENABLED or before ENABLED is set. If SW needs to change the controller to different mode, it needs to make sure that HW is quiescent before doing so.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SLAVE_MODE</name>
                    <description>Slave mode</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MASTER_MODE</name>
                    <description>Master mode</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLED</name>
                <description>Channel enable:
'0': Disabled. If a channel is disabled, CMD, STATUS, INTR MMIO registers will have their fields reset to their default value.
'1': Enabled.</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DISABLED</name>
                    <description>Disabled</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>ENABLED</name>
                    <description>Enabled</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CTL1</name>
            <description>Control 1</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FDFF1FF</resetMask>
            <fields>
              <field>
                <name>T_LOW1</name>
                <description>Low count for logic 1. This is valid only for PWM mode.
For master node, The count value here indicates the number of clocks per clk_cxpi_ch to drive a '0' at CXPI bus before releasing it to indicate a logical '1'. For slave node and pre-sample enabled, the count value indicates the number of clocks per clk_cxpi_ch to disable pre-sampling.
0: means 1 clock.
1: means 2 clocks
..
15: means 16 clocks.
..
399: means 400 clocks.
Any value above 399 is invalid.
Note that for NRZ mode, this field is ignored.
Note that it must be set less than CTL1.T_OFFSET for slave node if pre-sample mode enabled.
Note that it is also effective for pre-sample mode of master node.</description>
                <bitRange>[8:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>T_LOW0</name>
                <description>Low count for logic 0. This is valid only for PWM mode.
The count value here indicates the number of clocks per clk_cxpi_ch to drive a '0' at CXPI bus before releasing it to indicate a logical '0'.
0: means 1 clock.
1: means 2 clocks
..
15: means 16 clocks
..
399: means 400 clocks
Any value above 399 is invalid.
Note that for NRZ mode, this field is ignored.
Note that this field is used for TX.</description>
                <bitRange>[20:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>T_OFFSET</name>
                <description>The value of offset that is used for sampling the 'rx'. 
The value of this counter is used in HW as below.

   - 0 : means 1 clock after detecting falling edge of 'rx'
   - 1 : means 2 clocks after detecting falling edge of 'rx'
   ..
   - 7 : means 8 clocks after detecting falling edge of 'rx'
   ..
  - 15 : means 16 clocks after detecting falling edge of 'rx'
   ..
  - 399 : means 400 clocks after detecting falling edge of 'rx'
Any value above 399 is invalid.</description>
                <bitRange>[30:22]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CTL2</name>
            <description>Control 2</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFCF3F03</resetMask>
            <fields>
              <field>
                <name>RETRY</name>
                <description>Number of retries after arbitration lost.
'0': No retries.
..
'3': 3 retries.
HW will immediately retry after arbitration lost i.e. after the message frame that won the arbitration is complete and fulfilled IFS. If SW wants to manage the retransmission then SW can program RETRY =0. In this case, HW will not retry after arbitration lost and will set TX_HEADER_ARB_LOST bit. SW needs to trigger HW to resend by programming the CMD fields again.</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>T_WAKEUP_LENGTH</name>
                <description>Specifies the wake up pulse low period in Tbits that is transmitted during Standby mode.
'0': 1 bit period
'1': 2 bit period
..
'49': 50 bit period
Any value above 49 is invalid. 
This field is only valid if TX_WAKE_PULSE is set to 1.</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TIMEOUT_LENGTH</name>
                <description>Timeout Length (in Tbits). Specifies the number of Tbits to exceed timeout between frame bytes within a message frame. CXPI spec states that the maximum allowed inter byte space (IBS) is 9Tbits.  
This field is valid only when TIMEOUT_SEL=1/2.
'0' - 1Tbit
'1' - 2Tbits
..
'9' - 10Tbits
Values &gt;9 is invalid per CXPI spec.
Note for NRZ mode, although there are propagation delay from transceiver to CXPI controller, the delay is cancelled out as the timeout is compared on the RX (for transmit case, HW waits for the feedback on RX).</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RXTX_DELAY</name>
                <description>Insert addtional delay from the falling edge of RX to the falling edge of TX for slave node transmitting '0'. This is valid only for PWM mode.
The count value here indicates the number of clocks per clk_cxpi_ch.
0: None 
1: means 1 clock.
2: means 2 clocks.
...
255: means 255 clocks.
Note it must be set less than CTL1.T_LOW0. 
Note make sure that the falling edge of tx_out is ahead of the rising edge of master node clock when CTL0.PRESAMPLE_EN=1.</description>
                <bitRange>[29:22]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TIMEOUT_SEL</name>
                <description>Timeout Select. 
'0' - Timeout check is disabled. HW clears timeout counter.
'1' - Timeout check is enabled and HW will refer to TIMEOUT_LENGTH as number of Tbits allowed between header and response.
'2' - Timeout check is enabled to check header-header, header-response, and header-header-response within a message frame to be space within TIMEOUT_LENGTH bit time.
'3' - invalid
For '1', HW will restart/start timeout counter after transmitting/receiving header. HW will hold the counter if timeout until the next header is transmitted or received. Timeout will cause HW to stop transmission of the current message frame together with interrupt to SW. For receive, HW abort reception of the frame if timeout occurs while waiting for receiving response and notify SW with interrupt.
For '2', HW will re-start/start timeout counter after receiving any frame bytes within a message frame. HW will hold the counter if timeout until the IFS. Timeout will cause HW to stop transmission of the current message frame and notify SW with interrupt. For receive, HW will abort reception of the message frame if timeout occurs while waiting for receiving response and notify SW with interrupt.
For all cases, HW stops counting when it is out of a message frame such as IFS or CXPI bus IDLE. If the timeout counter &gt; TIMEOUT_LENGTH, then it will set the INTR.TIMEOUT=1. 
Note that, TIMEOUT_SEL=1/2 also enables the count for IBS between receive header and transmit response on top of timeout check.</description>
                <bitRange>[31:30]</bitRange>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>TIMEOUT_DISABLED</name>
                    <description>Timeout check is disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMEOUT_CHECK_BTW_HDR_RSP</name>
                    <description>Timeout check is enabled and HW will refer to TIMEOUT_LENGHT as number of Tbits allowed between header and response.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>TIMEOUT_CHECK_BTW_HDR_HDR_RSP</name>
                    <description>Timeout check is enabled to check header-header, header-response, and header-header-response within a message frame to be space within TIMEOUT_LENGTH bit time.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
