zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hvms64k.svd
          <register>
            <name>STATUS</name>
            <description>Status</description>
            <addressOffset>0xC</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7FFC3313</resetMask>
            <fields>
              <field>
                <name>RETRIES_COUNT</name>
                <description>Retries count. 
The value reflects the number of retries that HW tries to transmit a header/response. 
HW will reset counter (either case below):
1. after successfully transmit the retry attempt 
2. SW clears the CMD.TX_HEADER='0' 
3. HW clearing CMD.TX_HEADER=0 due to errors (TX_BIT_ERROR, TX_HEADER_ARB_LOST, TX_OVERFLOW_ERROR, TX_UNDERFLOW_ERROR, TX_DATA_LENGTH_ERROR, and TX_FRAME_ERROR)</description>
                <bitRange>[1:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HEADER_RESPONSE</name>
                <description>Frame header/response identifier (only valid when TX_BUSY or RX_BUSY is '1')
'0' - Frame header being transferred.
'1' - Frame response being transferred.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_BUSY</name>
                <description>Transmitter busy.
- Set to '1' on the start of the following commands: TX_HEADER, TX_RESPONSE.
- Set to '0' on successful completion of previous commands or when an error is detected.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_BUSY</name>
                <description>Receiver busy.
- Set to '1' on the start of the following commands: RX_HEADER, RX_RESPONSE.
- Set to '0' on successful completion of previous commands or when an error is detected.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_DONE</name>
                <description>Transmitter done:
- Set to '0' on the start of a new command.
- Set to '1' on successful completion of the following command sequences:
- TX_HEADER.
- TX_HEADER, TX_RESPONSE.
- RX_HEADER, TX_RESPONSE.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_DONE</name>
                <description>Receiver done:
- Set to '0' on the start of a new command.
- Set to '1' on successful completion of the following commmand sequences:
- RX_HEADER, RX_RESPONSE.
- TX_HEADER, RX_RESPONSE.</description>
                <bitRange>[13:13]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TIMEOUT</name>
                <description>Copy of INTR.TIMEOUT</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_HEADER_ARB_LOST</name>
                <description>Copy of INTR.TX_HEADER_ARB_LOST</description>
                <bitRange>[19:19]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_BIT_ERROR</name>
                <description>Copy of INTR.TX_BIT_ERROR.</description>
                <bitRange>[20:20]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_CRC_ERROR</name>
                <description>Copy of INTR.RX_CRC_ERROR.</description>
                <bitRange>[21:21]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_HEADER_PARITY_ERROR</name>
                <description>Copy of INTR.RX_HEADER_PARITY_ERROR.</description>
                <bitRange>[22:22]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_DATA_LENGTH_ERROR</name>
                <description>Copy of INTR.RX_DATA_LENGTH_ERROR.</description>
                <bitRange>[23:23]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_DATA_LENGTH_ERROR</name>
                <description>Copy of INTR.TX_DATA_LENGTH_ERROR.</description>
                <bitRange>[24:24]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_OVERFLOW_ERROR</name>
                <description>Copy of INTR.RX_OVERFLOW_ERROR.</description>
                <bitRange>[25:25]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_OVERFLOW_ERROR</name>
                <description>Copy of INTR.TX_OVERFLOW_ERROR.</description>
                <bitRange>[26:26]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_UNDERFLOW_ERROR</name>
                <description>Copy of INTR.RX_UNDERFLOW_ERROR.</description>
                <bitRange>[27:27]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_UNDERFLOW_ERROR</name>
                <description>Copy of INTR.TX_UNDERFLOW_ERROR.</description>
                <bitRange>[28:28]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FRAME_ERROR</name>
                <description>Copy of INTR.RX_FRAME_ERROR.</description>
                <bitRange>[29:29]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FRAME_ERROR</name>
                <description>Copy of INTR.TX_FRAME_ERROR.</description>
                <bitRange>[30:30]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CMD</name>
            <description>Command</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x33F</resetMask>
            <fields>
              <field>
                <name>TX_HEADER</name>
                <description>SW sets this field to '1' to transmit a header. HW sets this field to '0' on successful completion of ANY of the following legal command sequences (also set to '0' when an error (such as bit error if bit_ignore=0, arbitration loss, tx data length error. For timeout please refer to SAS) is detected):
- TX_HEADER
- TX_HEADER, TX_RESPONSE.
- TX_HEADER, RX_RESPONSE.
The above is for transmission of PID without prior transmission of PTYPE.
The header is transmitted when the PID field STOP bits are transmitted (INTR.TX_HEADER_DONE).

HW sets this field to '1', when the 'tr_cmd_tx_header' input trigger is activated. This allows for time triggered CXPI message transfer. HW driven time triggered transfer eliminates the jitter that is typically associated with SW driven transfer.
SW clears this field to '0', when it wants to cancel a pending request. Note that if SW clears this field to '0' while HW is already in the middle of the request, then the cancel will be ignored. The cancel request can happen when HW is pending a retry when it is still servicing the current transaction. Or the cancel request can occur when HW is checking IFS/bus idle-ness.
Note that if PTYPE (TX_HEADER) is transmitted follow by receive response (RX_RESPONSE) or no response, HW clears TX_HEADER right after transmitting PTYPE.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_RESPONSE</name>
                <description>SW sets this field to '1' to transmit a response. HW sets this field to '0' on successful completion of ANY of the legal command sequences (also set to '0' when an error is detected).
- TX_HEADER, TX_RESPONSE.
- RX_HEADER, TX_RESPONSE.

SW can also clear this field to '0' if SW wants to cancel the TX_RESPONSE. 

