zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/svd/psoc4hvms64k.svd
The response is transmitted when the CRC are transmitted (INTR.TX_RESPONSE_DONE).</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SLEEP</name>
                <description>SW sets this field to '1' to direct HW to sleep mode. HW transits from Normal to Sleep upon SLEEP=1 and both TX and RX is idle. HW sets this field to '0' when it is in Sleep mode. 

Note that, SW needs to manage the entry to sleep mode by checking the conditions are met before initiating sleep mode e.g. all slave nodes supports sleep and on transmitting sleep frames to indicate sleep to all slave nodes.SW shall not program SLEEP=1 when HW is executing TX_WAKEUP_PULSE command. If SW programs SLEEP=1 during HW executing TX_WAKEUP_PULSE command, it will cause HW to abruptly stop transmitting wakeup pulse as below:
1. HW not clearing TX_WAKEUP_PULSE
2. HW not setting TX_WAKEUP_DONE 
3. HW outputting TX_OUT=0.</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>WAKE_TO_STANDBY</name>
                <description>SW sets this field to '1' to direct HW to wake up from Sleep mode to Standby mode. SW clears this field to '0' from '1' when it wants to direct HW from Standby to Normal mode. HW clears this field to '0' when it is in Normal mode or back to Sleep mode from Standby mode. 

For the case of CXPI master mode, HW will move its power mode from Sleep-&gt;Standby when this field is set to '1'. When SW clears this field is from '1' to '0' in Standby mode, HW will move to Normal mode while HW starts transmitting clock. To transmit wake pulse, SW need to program TX_WAKE_PULSE accordingly in Standby mode before entering Normal.
For the case of CXPI slave mode and PWM mode, HW will move power mode from Sleep-&gt;Standby when this field is set to '1'. HW will wait for detection of clock before moving from Standby-&gt;Normal. SW clearing this field to '0' will have no effect.
For the case of CXPI slave mode and NRZ mode, HW will move power mode from Sleep-&gt;Standby when this field is set to '1'. HW needs to be directed by SW by clearing this field to '0' to move from Standby-&gt;Normal after SW has detected clock through another IP (e.g. MXTCPWM).</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_WAKE_PULSE</name>
                <description>SW sets this field to '1' to direct HW to send wake up pulse. HW will transmit wake up pulse in Standby state only. HW will ignore this field when it's not in Standby state. 
'1' - HW will drive CXPI bus to low for period dictated by T_WAKEUP_LENGTH.
'0:'- No wake up pulse 
HW clears this field to '0' after it transmit the pulse per T_WAKEUP_LENGTH.
For the case where more than 1 wake pulses are required, SW is expected to set this field to '1' again (after this field is cleared to '0') per the number of times the wake pulse is required.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IFS_WAIT</name>
                <description>SW sets this field to '1' to wait for IFS. HW clears this field to '0' after it detects logical '1' based on IFS. 

HW will keep this field to '1' if it detects logical '0' before fulfilling the number of logical '1' required. 

The intention of this bit is to provide capability for SW to direct HW to check bus idle-ness before transmitting. Without setting this bit before directing HW to send header, HW will not check bus idle before transmitting. Besides that, this bit will also provide SW an option to configure HW to wait for IFS before sending again PTYPE or PID to fulfill IFS if there is no response from other nodes. 
Note: SW needs to configure valid IFS values before setting IFS_WAIT=1.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_HEADER</name>
                <description>SW sets this field to '1' to receive a header. HW sets this field to '0' on successful completion of the ANY of the legal command sequences.
(Not set to '0' when an error is detected).
-RX_HEADER
-RX_HEADER, TX_RESPONSE
-RX_HEADER, RX_RESPONSE
The above applies for cases of receiving PID without prior receiving PTYPE.
The header is received when the PID field STOP bits are received (INTR.RX_HEADER_PID_DONE and INTR.RX_HEADER_DONE). 

Typically, a slave node SW sets both RX_HEADER and RX_RESPONSE to '1', anticipating a transfer of a response from the master node to this slave node. After receipt of the header PID/PTYPE field (INTR.RX_HEADER_PID_DONE is activated), the slave node may decide to set TX_RESPONSE to '1' (which has lower priority than RX_RESPONSE hence RX_RESPONSE need to be clear to '0' by SW) to transmit a response.
Note that, for cases with RXPIDZERO_CHECK_EN=1 for slave in polling mode, RX_HEADER is cleared upon receiving PTYPE if the next course of action is to transmit PID. If the next course of action is to receive PID, then the RX_HEADER is cleared upon completion of response.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_RESPONSE</name>
                <description>SW sets this field to '1' to receive a response. HW sets this field to '0' on successful completion of ANY of the legal command sequences (NOT set to '0' when an error is detected).
-TX_HEADER, RX_RESPONSE
-RX_HEADER, RX_RESPONSE

SW can set this field to '1' to be conservative on receiving response i.e. IBS=0 whenever it is receiving PID. If the PID corresponds to transmit response, the SW can then clear this field to '0' and set TX_RESPONSE=1 to direct HW to send response. 

